apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_efuse_table.c
static const efuse_desc_t DIS_ICACHE[] =
{
  {
    40, 1  /* Disable Icache, */
  },
};

static const efuse_desc_t DIS_DCACHE[] =
{
  {
    41, 1  /* Disable DCACHE, */
  },
};

static const efuse_desc_t DIS_DOWNLOAD_ICACHE[] =
{
  {
    42, 1  /* Disable Icache in download mode, include boot_mode 0 1 2 3 6 7, */
  },
};

static const efuse_desc_t DIS_DOWNLOAD_DCACHE[] =
{
  {
    43, 1  /* Disable Dcache in download mode include boot_mode 0 1 2 3 6 7, */
  },
};

static const efuse_desc_t DIS_FORCE_DOWNLOAD[] =
{
  {
    44, 1  /* Disable force chip go to download mode function, */
  },
};

static const efuse_desc_t DIS_USB[] =
{
  {
    45, 1  /* Disable USB function, */
  },
};

static const efuse_desc_t DIS_CAN[] =
{
  {
    46, 1  /* Disable CAN function, */
  },
};

static const efuse_desc_t DIS_APP_CPU[] =
{
  {
    47, 1  /* Disables APP CPU, */
  },
};

static const efuse_desc_t SOFT_DIS_JTAG[] =
{
  {
    48, 3  /* Software disables JTAG by programming odd number of 1 bit(s). JTAG can be re-enabled via HMAC peripheral, */
  },
};

static const efuse_desc_t HARD_DIS_JTAG[] =
{
  {
    51, 1  /* Hardware disable jtag permanently disable jtag function, */
  },
};

static const efuse_desc_t DIS_DOWNLOAD_MANUAL_ENCRYPT[] =
{
  {
    52, 1  /* Disable flash encrypt function, */
  },
};

static const efuse_desc_t USB_EXCHG_PINS[] =
{
  {
    57, 1  /* Exchange D+ D- pins, */
  },
};

static const efuse_desc_t USB_EXT_PHY_ENABLE[] =
{
  {
    58, 1  /* Enable external PHY, */
  },
};

static const efuse_desc_t BTLC_GPIO_ENABLE[] =
{
  {
    59, 2  /* Enable BTLC GPIO, */
  },
};

static const efuse_desc_t VDD_SPI_XPD[] =
{
  {
    68, 1  /* VDD_SPI regulator power up, */
  },
};

static const efuse_desc_t VDD_SPI_TIEH[] =
{
  {
    69, 1  /* VDD_SPI regulator tie high to vdda, */
  },
};

static const efuse_desc_t VDD_SPI_FORCE[] =
{
  {
    70, 1  /* Force using eFuse configuration of VDD_SPI, */
  },
};

static const efuse_desc_t WDT_DELAY_SEL[] =
{
  {
    80, 2  /* Select RTC WDT time out threshold, */
  },
};

static const efuse_desc_t SPI_BOOT_CRYPT_CNT[] =
{
  {
    82, 3  /* SPI boot encrypt decrypt enable. odd number 1 enable. even number 1 disable, */
  },
};

static const efuse_desc_t SECURE_BOOT_KEY_REVOKE0[] =
{
  {
    85, 1  /* Enable revoke first secure boot key, */
  },
};

static const efuse_desc_t SECURE_BOOT_KEY_REVOKE1[] =
{
  {
    86, 1  /* Enable revoke second secure boot key, */
  },
};

static const efuse_desc_t SECURE_BOOT_KEY_REVOKE2[] =
{
  {
    87, 1  /* Enable revoke third secure boot key, */
  },
};

static const efuse_desc_t KEY_PURPOSE_0[] =
{
  {
    88, 4  /* Key0 purpose, */
  },
};

static const efuse_desc_t KEY_PURPOSE_1[] =
{
  {
    92, 4  /* Key1 purpose, */
  },
};

static const efuse_desc_t KEY_PURPOSE_2[] =
{
  {
    96, 4  /* Key2 purpose, */
  },
};

static const efuse_desc_t KEY_PURPOSE_3[] =
{
  {
    100, 4  /* Key3 purpose, */
  },
};

static const efuse_desc_t KEY_PURPOSE_4[] =
{
  {
    104, 4  /* Key4 purpose, */
  },
};

static const efuse_desc_t KEY_PURPOSE_5[] =
{
  {
    108, 4  /* Key5 purpose, */
  },
};

static const efuse_desc_t SECURE_BOOT_EN[] =
{
  {
    116, 1  /* Secure boot enable, */
  },
};

static const efuse_desc_t SECURE_BOOT_AGGRESSIVE_REVOKE[] =
{
  {
    117, 1  /* Enable aggressive secure boot revoke, */
  },
};

static const efuse_desc_t DIS_USB_JTAG[] =
{
  {
    118, 1  /* Set to disable usb_serial_jtag-to-jtag function, */
  },
};

static const efuse_desc_t DIS_USB_SERIAL_JTAG[] =
{
  {
    119, 1  /* Set to disable usb_serial_jtag module, */
  },
};

static const efuse_desc_t STRAP_JTAG_SEL[] =
{
  {
    120, 1  /* Enable selection between usb_to_jtag or pad_to_jtag through gpio10, */
  },
};

static const efuse_desc_t USB_PHY_SEL[] =
{
  {
    121, 1  /* Select internal/external PHY for USB OTG and usb_serial_jtag, */
  },
};

static const efuse_desc_t FLASH_TPUW[] =
{
  {
    124, 4  /* Flash wait time after power up. (unit is ms). When value is 15. the time is 30 ms, */
  },
};

static const efuse_desc_t DIS_DOWNLOAD_MODE[] =
{
  {
    128, 1  /* Disable download mode include boot_mode[3:0] is 0 1 2 3 6 7, */
  },
};

static const efuse_desc_t DIS_LEGACY_SPI_BOOT[] =
{
  {
    129, 1  /* Disable_Legcy_SPI_boot mode include boot_mode[3:0] is 4, */
  },
};

static const efuse_desc_t UART_PRINT_CHANNEL[] =
{
  {
    130, 1  /* 0: UART0. 1: UART1, */
  },
};

static const efuse_desc_t FLASH_ECC_MODE[] =
{
  {
    131, 1  /* Configures the ECC mode for SPI flash. 0:16-byte to 18-byte mode. 1:16-byte to 17-byte mode, */
  },
};

static const efuse_desc_t DIS_USB_DOWNLOAD_MODE[] =
{
  {
    132, 1  /* Disable download through USB, */
  },
};

static const efuse_desc_t ENABLE_SECURITY_DOWNLOAD[] =
{
  {
    133, 1  /* Enable security download mode, */
  },
};

static const efuse_desc_t UART_PRINT_CONTROL[] =
{
  {
    134, 2  /* b00:force print. b01:control by GPIO46 - low level print. b10:control by GPIO46 - high level print. b11:force disable print., */
  },
};

static const efuse_desc_t PIN_POWER_SELECTION[] =
{
  {
    136, 1  /* GPIO33-GPIO37 power supply selection in ROM code. 0:VDD3P3_CPU. 1:VDD_SPI., */
  },
};

static const efuse_desc_t FLASH_TYPE[] =
{
  {
    137, 1  /* Connected Flash interface type. 0: 4 data line. 1: 8 data line, */
  },
};

static const efuse_desc_t FLASH_PAGE_SIZE[] =
{
  {
    138, 2  /* Sets the size of flash page, */
  },
};

static const efuse_desc_t FLASH_ECC_EN[] =
{
  {
    140, 1  /* Enables ECC in Flash boot mode, */
  },
};

static const efuse_desc_t FORCE_SEND_RESUME[] =
{
  {
    141, 1  /* Force ROM code to send a resume command during SPI boot, */
  },
};

static const efuse_desc_t SECURE_VERSION[] =
{
  {
    142, 16  /* Secure version for anti-rollback, */
  },
};

static const efuse_desc_t MAC_FACTORY[] =
{
  {
    296, 8  /* Factory MAC addr [0], */
  },
  {
    288, 8  /* Factory MAC addr [1], */
  },
  {
    280, 8  /* Factory MAC addr [2], */
  },
  {
    272, 8  /* Factory MAC addr [3], */
  },
  {
    264, 8  /* Factory MAC addr [4], */
  },
  {
    256, 8  /* Factory MAC addr [5], */
  },
};

