apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_efuse_table.c
const efuse_desc_t *ESP_EFUSE_WR_DIS_USB_EXCHG_PINS[] =
{
  &WR_DIS_USB_EXCHG_PINS[0],  /* Write protection for USB_EXCHG_PINS */
  NULL
};

const efuse_desc_t *ESP_EFUSE_RD_DIS[] =
{
  &RD_DIS[0],  /* Read protection */
  NULL
};

const efuse_desc_t *ESP_EFUSE_RDWR_DIS_SYS_DATA_PART2_DIS_KEY0[] =
{
  &RDWR_DIS_SYS_DATA_PART2_DIS_KEY0[0],  /* Read protection for EFUSE_BLK4.  KEY0 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_RD_DIS_KEY1[] =
{
  &RD_DIS_KEY1[0],  /* Read protection for EFUSE_BLK5.  KEY1 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_RD_DIS_KEY2[] =
{
  &RD_DIS_KEY2[0],  /* Read protection for EFUSE_BLK6.  KEY2 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_RD_DIS_KEY3[] =
{
  &RD_DIS_KEY3[0],  /* Read protection for EFUSE_BLK7.  KEY3 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_RD_DIS_KEY4[] =
{
  &RD_DIS_KEY4[0],  /* Read protection for EFUSE_BLK8.  KEY4 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_RD_DIS_KEY5[] =
{
  &RD_DIS_KEY5[0],  /* Read protection for EFUSE_BLK9.  KEY5 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_RD_DIS_SYS_DATA_PART2[] =
{
  &RD_DIS_SYS_DATA_PART2[0],  /* Read protection for EFUSE_BLK10. SYS_DATA_PART2 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_RTC_RAM_BOOT[] =
{
  &DIS_RTC_RAM_BOOT[0],  /* Disable boot from RTC RAM */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_ICACHE[] =
{
  &DIS_ICACHE[0],  /* Disable Icache */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_DCACHE[] =
{
  &DIS_DCACHE[0],  /* Disable DCACHE */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_DOWNLOAD_ICACHE[] =
{
  &DIS_DOWNLOAD_ICACHE[0],  /* Disable Icache in download mode */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_DOWNLOAD_DCACHE[] =
{
  &DIS_DOWNLOAD_DCACHE[0],  /* Disable Dcache in download mode include boot_mode 0 1 2 3 6 7, */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_FORCE_DOWNLOAD[] =
{
  &DIS_FORCE_DOWNLOAD[0],  /* Disable force chip go to download mode function */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_USB[] =
{
  &DIS_USB[0],  /* Disable USB function */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_CAN[] =
{
  &DIS_CAN[0],  /* Disable CAN function */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_APP_CPU[] =
{
  &DIS_APP_CPU[0],  /* Disables APP CPU */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SOFT_DIS_JTAG[] =
{
  &SOFT_DIS_JTAG[0],  /* Software disables JTAG by programming odd number of 1 bit(s). JTAG can be re-enabled via HMAC peripheral */
  NULL
};

const efuse_desc_t *ESP_EFUSE_HARD_DIS_JTAG[] =
{
  &HARD_DIS_JTAG[0],  /* Hardware disable jtag permanently disable jtag function */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT[] =
{
  &DIS_DOWNLOAD_MANUAL_ENCRYPT[0],  /* Disable flash encrypt function */
  NULL
};

const efuse_desc_t *ESP_EFUSE_USB_EXCHG_PINS[] =
{
  &USB_EXCHG_PINS[0],  /* Exchange D+ D- pins */
  NULL
};

const efuse_desc_t *ESP_EFUSE_USB_EXT_PHY_ENABLE[] =
{
  &USB_EXT_PHY_ENABLE[0],  /* Enable external PHY */
  NULL
};

const efuse_desc_t *ESP_EFUSE_BTLC_GPIO_ENABLE[] =
{
  &BTLC_GPIO_ENABLE[0],  /* Enable BTLC GPIO */
  NULL
};

const efuse_desc_t *ESP_EFUSE_VDD_SPI_XPD[] =
{
  &VDD_SPI_XPD[0],  /* VDD_SPI regulator power up */
  NULL
};

const efuse_desc_t *ESP_EFUSE_VDD_SPI_TIEH[] =
{
  &VDD_SPI_TIEH[0],  /* VDD_SPI regulator tie high to vdda */
  NULL
};

const efuse_desc_t *ESP_EFUSE_VDD_SPI_FORCE[] =
{
  &VDD_SPI_FORCE[0],  /* Force using eFuse configuration of VDD_SPI */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WDT_DELAY_SEL[] =
{
  &WDT_DELAY_SEL[0],  /* Select RTC WDT time out threshold */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_BOOT_CRYPT_CNT[] =
{
  &SPI_BOOT_CRYPT_CNT[0],  /* SPI boot encrypt decrypt enable. odd number 1 enable. even number 1 disable */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SECURE_BOOT_KEY_REVOKE0[] =
{
  &SECURE_BOOT_KEY_REVOKE0[0],  /* Enable revoke first secure boot key */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SECURE_BOOT_KEY_REVOKE1[] =
{
  &SECURE_BOOT_KEY_REVOKE1[0],  /* Enable revoke second secure boot key */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SECURE_BOOT_KEY_REVOKE2[] =
{
  &SECURE_BOOT_KEY_REVOKE2[0],  /* Enable revoke third secure boot key */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY_PURPOSE_0[] =
{
  &KEY_PURPOSE_0[0],  /* Key0 purpose */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY_PURPOSE_1[] =
{
  &KEY_PURPOSE_1[0],  /* Key1 purpose */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY_PURPOSE_2[] =
{
  &KEY_PURPOSE_2[0],  /* Key2 purpose */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY_PURPOSE_3[] =
{
  &KEY_PURPOSE_3[0],  /* Key3 purpose */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY_PURPOSE_4[] =
{
  &KEY_PURPOSE_4[0],  /* Key4 purpose */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY_PURPOSE_5[] =
{
  &KEY_PURPOSE_5[0],  /* Key5 purpose */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SECURE_BOOT_EN[] =
{
  &SECURE_BOOT_EN[0],  /* Secure boot enable */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE[] =
{
  &SECURE_BOOT_AGGRESSIVE_REVOKE[0],  /* Enable aggressive secure boot revoke */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_USB_JTAG[] =
{
  &DIS_USB_JTAG[0],  /* Set to disable usb_serial_jtag-to-jtag function */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_USB_SERIAL_JTAG[] =
{
  &DIS_USB_SERIAL_JTAG[0],  /* Set to disable usb_serial_jtag module */
  NULL
};

const efuse_desc_t *ESP_EFUSE_STRAP_JTAG_SEL[] =
{
  &STRAP_JTAG_SEL[0],  /* Set to disable usb_serial_jtag module */
  NULL
};

const efuse_desc_t *ESP_EFUSE_USB_PHY_SEL[] =
{
  &USB_PHY_SEL[0],  /* Select internal/external PHY for USB OTG and usb_serial_jtag */
  NULL
};

const efuse_desc_t *ESP_EFUSE_FLASH_TPUW[] =
{
  &FLASH_TPUW[0],  /* Flash wait time after power up. (unit is ms). When value is 15. the time is 30 ms */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_DOWNLOAD_MODE[] =
{
  &DIS_DOWNLOAD_MODE[0],  /* Disable download mode include boot_mode[3:0] is 0 1 2 3 6 7 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_LEGACY_SPI_BOOT[] =
{
  &DIS_LEGACY_SPI_BOOT[0],  /* Disable_Legcy_SPI_boot mode include boot_mode[3:0] is 4 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_UART_PRINT_CHANNEL[] =
{
  &UART_PRINT_CHANNEL[0],  /* 0: UART0. 1: UART1 */
  NULL
};

