apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_efuse_table.c
const efuse_desc_t *ESP_EFUSE_FLASH_ECC_MODE[] =
{
  &FLASH_ECC_MODE[0],  /* Configures the ECC mode for SPI flash. 0:16-byte to 18-byte mode. 1:16-byte to 17-byte mode */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_USB_DOWNLOAD_MODE[] =
{
  &DIS_USB_DOWNLOAD_MODE[0],  /* Disable download through USB */
  NULL
};

const efuse_desc_t *ESP_EFUSE_ENABLE_SECURITY_DOWNLOAD[] =
{
  &ENABLE_SECURITY_DOWNLOAD[0],  /* Enable security download mode */
  NULL
};

const efuse_desc_t *ESP_EFUSE_UART_PRINT_CONTROL[] =
{
  &UART_PRINT_CONTROL[0],  /* b00:force print. b01:control by GPIO46 - low level print. b10:control by GPIO46 - high level print. b11:force disable print. */
  NULL
};

const efuse_desc_t *ESP_EFUSE_PIN_POWER_SELECTION[] =
{
  &PIN_POWER_SELECTION[0],  /* GPIO33-GPIO37 power supply selection in ROM code. 0:VDD3P3_CPU. 1:VDD_SPI. */
  NULL
};

const efuse_desc_t *ESP_EFUSE_FLASH_TYPE[] =
{
  &FLASH_TYPE[0],  /* Connected Flash interface type. 0: 4 data line. 1: 8 data line */
  NULL
};

const efuse_desc_t *ESP_EFUSE_FLASH_PAGE_SIZE[] =
{
  &FLASH_PAGE_SIZE[0],  /* Sets the size of flash page */
  NULL
};

const efuse_desc_t *ESP_EFUSE_FLASH_ECC_EN[] =
{
  &FLASH_ECC_EN[0],  /* Enables ECC in Flash boot mode */
  NULL
};

const efuse_desc_t *ESP_EFUSE_FORCE_SEND_RESUME[] =
{
  &FORCE_SEND_RESUME[0],  /* Force ROM code to send a resume command during SPI boot */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SECURE_VERSION[] =
{
  &SECURE_VERSION[0],  /* Secure version for anti-rollback */
  NULL
};

const efuse_desc_t *ESP_EFUSE_MAC_FACTORY[] =
{
  &MAC_FACTORY[0],  /* Factory MAC addr [0] */
  &MAC_FACTORY[1],  /* Factory MAC addr [1] */
  &MAC_FACTORY[2],  /* Factory MAC addr [2] */
  &MAC_FACTORY[3],  /* Factory MAC addr [3] */
  &MAC_FACTORY[4],  /* Factory MAC addr [4] */
  &MAC_FACTORY[5],  /* Factory MAC addr [5] */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_CLK[] =
{
  &SPI_PAD_CONFIG_CLK[0],  /* SPI_PAD_configure CLK */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_Q_D1[] =
{
  &SPI_PAD_CONFIG_Q_D1[0],  /* SPI_PAD_configure Q(D1) */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_D_D0[] =
{
  &SPI_PAD_CONFIG_D_D0[0],  /* SPI_PAD_configure D(D0) */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_CS[] =
{
  &SPI_PAD_CONFIG_CS[0],  /* SPI_PAD_configure CS */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_HD_D3[] =
{
  &SPI_PAD_CONFIG_HD_D3[0],  /* SPI_PAD_configure HD(D3) */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_WP_D2[] =
{
  &SPI_PAD_CONFIG_WP_D2[0],  /* SPI_PAD_configure WP(D2) */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_DQS[] =
{
  &SPI_PAD_CONFIG_DQS[0],  /* SPI_PAD_configure DQS */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_D4[] =
{
  &SPI_PAD_CONFIG_D4[0],  /* SPI_PAD_configure D4 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_D5[] =
{
  &SPI_PAD_CONFIG_D5[0],  /* SPI_PAD_configure D5 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_D6[] =
{
  &SPI_PAD_CONFIG_D6[0],  /* SPI_PAD_configure D6 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_D7[] =
{
  &SPI_PAD_CONFIG_D7[0],  /* SPI_PAD_configure D7 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SYS_DATA_PART1[] =
{
  &SYS_DATA_PART1[0],  /* System configuration */
  NULL
};

const efuse_desc_t *ESP_EFUSE_USER_DATA[] =
{
  &USER_DATA[0],  /* User data */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY0[] =
{
  &KEY0[0],  /* Key0 or user data */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY1[] =
{
  &KEY1[0],  /* Key1 or user data */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY2[] =
{
  &KEY2[0],  /* Key2 or user data */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY3[] =
{
  &KEY3[0],  /* Key3 or user data */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY4[] =
{
  &KEY4[0],  /* Key4 or user data */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY5[] =
{
  &KEY5[0],  /* Key5 or user data */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SYS_DATA_PART2[] =
{
  &SYS_DATA_PART2[0],  /* System configuration */
  NULL
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/
